; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph3 - mode
	image0 - mode
	infrared1 - mode
	infrared4 - mode
	spectrograph2 - mode
	thermograph5 - mode
	GroundStation0 - direction
	Star2 - direction
	Star4 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 infrared1)
	(supports instrument0 image0)
	(supports instrument0 infrared4)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 thermograph3)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star5)
	(supports instrument2 thermograph3)
	(supports instrument2 thermograph5)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
)
(:goal (and
	(pointing satellite0 Star4)
	(have_image Planet6 thermograph5)
	(have_image Star7 spectrograph2)
	(have_image Star7 infrared4)
	(have_image Phenomenon8 spectrograph2)
	(have_image Planet9 thermograph3)
	(have_image Phenomenon10 infrared4)
	(have_image Phenomenon10 thermograph3)
	(have_image Planet11 infrared1)
	(have_image Planet12 spectrograph2)
	(have_image Planet12 infrared4)
	(have_image Star13 thermograph5)
	(have_image Star13 spectrograph2)
	(have_image Star14 infrared1)
	(have_image Star14 spectrograph2)
	(have_image Planet15 infrared4)
	(have_image Planet15 infrared1)
))

)

; plan
1. (turn_to satellite0 groundstation1 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 17
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 17
3. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 17
4. (turn_to satellite0 star7 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star7)
   goals met: 0 of 17
5. (take_image satellite0 star7 instrument0 infrared4)
   added: (have_image star7 infrared4)
   goals met: 1 of 17
6. (turn_to satellite0 planet15 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet15)
   goals met: 1 of 17
7. (take_image satellite0 planet15 instrument0 infrared4)
   added: (have_image planet15 infrared4)
   goals met: 2 of 17
8. (take_image satellite0 planet15 instrument0 infrared1)
   added: (have_image planet15 infrared1)
   goals met: 3 of 17
9. (turn_to satellite0 planet12 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet12)
   goals met: 3 of 17
10. (take_image satellite0 planet12 instrument0 infrared4)
   added: (have_image planet12 infrared4)
   goals met: 4 of 17
11. (turn_to satellite0 phenomenon10 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 17
12. (take_image satellite0 phenomenon10 instrument0 thermograph3)
   added: (have_image phenomenon10 thermograph3)
   goals met: 5 of 17
13. (take_image satellite0 phenomenon10 instrument0 infrared4)
   added: (have_image phenomenon10 infrared4)
   goals met: 6 of 17
14. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 6 of 17
15. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 6 of 17
16. (turn_to satellite0 star5 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star5)
   goals met: 6 of 17
17. (calibrate satellite0 instrument1 star5)
   added: (calibrated instrument1)
   goals met: 6 of 17
18. (turn_to satellite0 phenomenon8 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon8)
   goals met: 6 of 17
19. (take_image satellite0 phenomenon8 instrument1 spectrograph2)
   added: (have_image phenomenon8 spectrograph2)
   goals met: 7 of 17
20. (turn_to satellite0 planet11 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet11)
   goals met: 7 of 17
21. (take_image satellite0 planet11 instrument1 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 8 of 17
22. (turn_to satellite0 planet12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet12)
   goals met: 8 of 17
23. (take_image satellite0 planet12 instrument1 spectrograph2)
   added: (have_image planet12 spectrograph2)
   goals met: 9 of 17
24. (turn_to satellite0 planet9 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet9)
   goals met: 9 of 17
25. (take_image satellite0 planet9 instrument1 thermograph3)
   added: (have_image planet9 thermograph3)
   goals met: 10 of 17
26. (turn_to satellite0 star13 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star13)
   goals met: 10 of 17
27. (take_image satellite0 star13 instrument1 spectrograph2)
   added: (have_image star13 spectrograph2)
   goals met: 11 of 17
28. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 11 of 17
29. (take_image satellite0 star14 instrument1 infrared1)
   added: (have_image star14 infrared1)
   goals met: 12 of 17
30. (take_image satellite0 star14 instrument1 spectrograph2)
   added: (have_image star14 spectrograph2)
   goals met: 13 of 17
31. (turn_to satellite0 star7 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star7)
   goals met: 13 of 17
32. (take_image satellite0 star7 instrument1 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 14 of 17
33. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 14 of 17
34. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 14 of 17
35. (turn_to satellite0 groundstation3 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation3)
   goals met: 14 of 17
36. (calibrate satellite0 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 14 of 17
37. (turn_to satellite0 planet6 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet6)
   goals met: 14 of 17
38. (take_image satellite0 planet6 instrument2 thermograph5)
   added: (have_image planet6 thermograph5)
   goals met: 15 of 17
39. (turn_to satellite0 star13 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star13)
   goals met: 15 of 17
40. (take_image satellite0 star13 instrument2 thermograph5)
   added: (have_image star13 thermograph5)
   goals met: 16 of 17
41. (turn_to satellite0 star4 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star4)
   goals met: 17 of 17
